src/Reports/ПрайсЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ПрайсЛист</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Reports/ПрайсЛист/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик для события формы ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктурнаяЕдиница							 = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	Организация 								 = СтруктурнаяЕдиница.Организация;
	Элементы.ОткрытьСписокСалоны.Заголовок  	 = Строка(СтруктурнаяЕдиница);    	
	СрезПрайса									 = ТекущаяДата();
	Элементы.ВыбратьПериодПланирования.Заголовок = Формат(СрезПрайса, "ДЛФ=ДД.ММ.ГГГГ");
	ВПродажеОтбор = "Все";
	Элементы.ОткрытьСписокВПродажеОтбор.Заголовок = ВПродажеОтбор;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка,
	|	СтруктурныеЕдиницы.Организация КАК Организация,
	|	Организации.ФИОРуководителя КАК ФИОРуководителя
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО СтруктурныеЕдиницы.Организация = Организации.Ссылка
	|ГДЕ
	|	СтруктурныеЕдиницы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда 
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ФИОГенДиректора = ВыборкаДетальныеЗаписи.ФИОРуководителя.Фамилия + " " +Лев(ВыборкаДетальныеЗаписи.ФИОРуководителя.Имя, 1) + ". " + Лев(ВыборкаДетальныеЗаписи.ФИОРуководителя.Отчество, 1) + ".";
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик для события формы ПриОткрытии
//
Процедура ПриОткрытии(Отказ)
	
	Элементы.ОтображатьЗаголовок.Пометка = Истина;
	ОтображатьЗаголовок = НЕ Элементы.ОтображатьЗаголовок.Пометка;
	СрезПрайса = ТекущаяДата();
	УстановитьПараметрыКомпоновкиОтчета();
	Элементы.Результат.ОтображениеСостояния.Текст = "Прайс-лист не сформирован. Нажмите ""Сформировать"" для получения прайс-листа.";
	Элементы.ГруппаПанельРезультат.Доступность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - Открыть список салонов.
//
// 
Процедура ОткрытьСписокСалонов(Команда)
	
	СписокЗначений = ПолучитьСписокСалонов();
	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокСалоновЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, СписокЗначений, ЭтаФорма.Элементы.ПереклКлиника);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Открыть список салонов заверщение
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ОткрытьСписокСалоновЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктурнаяЕдиница = Результат.Значение;	
	Элементы.ОткрытьСписокСалоны.Заголовок = Результат.Представление;
	
	НастройкиШапкиПрайсаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
// Процедура изменяет пометку кнопки ОтображатьЗаголовок.
//
Процедура ОтображатьЗаголовок(Команда) Экспорт
	
	Элементы.ОтображатьЗаголовок.Пометка = НЕ Элементы.ОтображатьЗаголовок.Пометка;
	ОтображатьЗаголовок = НЕ Элементы.ОтображатьЗаголовок.Пометка;
	УстановитьПараметрыКомпоновкиОтчета();
	
	Результат.ФиксацияСверху = 2;
	Результат.ФиксацияСлева = 0;
	
	Если Элементы.ОтображатьЗаголовок.Пометка Тогда
		СдвинутьОбластьДляЗаголовка();
		Результат.ФиксацияСверху = 6;
		Результат.ФиксацияСлева = 0;
	Иначе
		Результат.ФиксацияСверху = 2;
		Результат.ФиксацияСлева = 0;
	КонецЕсли;
	
	Результат.Автомасштаб = Истина;

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Обновить.
//
Процедура Обновить(Команда)
	
	ЭтаФорма.СкомпоноватьРезультат();
	ПроверкаФиксации();	
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Добавить.
//
Процедура Добавить(Команда)
	
	Попытка	
		СтруктураПараметров = ПолучитьДанныеРасшифровки(Элементы.Результат.ТекущаяОбласть.Расшифровка);
	Исключение
		ПоказатьПредупреждение(, "Выберите область номенклатуры");
		Возврат;
	КонецПопытки;
	
	СтруктураЗаполнения = Новый Структура("СтруктурнаяЕдиница, Номенклатура, ВидЦен");
	ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, СтруктураПараметров);
	
	ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", СтруктураЗаполнения));
	
КонецПроцедуры

&НаКлиенте
// Процедура - команды Скопировать.
//
Процедура Скопировать(Команда)
	
	Попытка
		СтруктураПараметров = ПолучитьДанныеРасшифровки(Элементы.Результат.ТекущаяОбласть.Расшифровка);
	Исключение
		ПоказатьПредупреждение(, "Выберите область номенклатуры");
		Возврат;
	КонецПопытки;
	
	СтруктураПараметров.Удалить("Период");
	
	Если Не (СтруктураПараметров.Свойство("Номенклатура") И СтруктураПараметров.Свойство("ВидЦен") И СтруктураПараметров.Свойство("Упаковка")) Тогда
		Возврат;
	КонецЕсли;	
	
	ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.ФормаЗаписи", Новый Структура("ЗначенияЗаполнения", СтруктураПараметров),,,,,);
		
КонецПроцедуры

&НаКлиенте
// Процедура - команды Изменить.
//
Процедура Изменить(Команда)
	
	СтруктураПараметров = ПолучитьДанныеРасшифровки(Элементы.Результат.ТекущаяОбласть.Расшифровка);
	
	Если Не (СтруктураПараметров.Свойство("Номенклатура") И СтруктураПараметров.Свойство("ВидЦен") И СтруктураПараметров.Свойство("Упаковка")) Тогда
		Возврат;
	КонецЕсли;
	
	КлючЗаписиСтруктурой = ПолучитьКлючЗаписи(СтруктураПараметров);
	Если КлючЗаписиСтруктурой <> Неопределено Тогда
		ПараметрыМассив = Новый Массив;
		ПараметрыМассив.Добавить(КлючЗаписиСтруктурой);
		КлючЗаписиРегистра = Новый("РегистрСведенийКлючЗаписи.ЦеныНоменклатуры", ПараметрыМассив);
		ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.Форма.ФормаЗаписиИзменениеЦены", Новый Структура("Ключ", КлючЗаписиРегистра),,,,,);
		
	Иначе
		Скопировать(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды Удалить.
//
Процедура Удалить(Команда)
	
	Попытка
		СтруктураПараметров = ПолучитьДанныеРасшифровки(Элементы.Результат.ТекущаяОбласть.Расшифровка);
	Исключение
		ПоказатьПредупреждение(, "Выберите область номенклатуры");
		Возврат;
	КонецПопытки;
	
	Если СтруктураПараметров.Свойство("Номенклатура") И СтруктураПараметров.Свойство("ВидЦен") И СтруктураПараметров.Свойство("Упаковка") Тогда
		УдалитьНаСервере(СтруктураПараметров); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды История.
//
Процедура История(Команда)
	
	Попытка
		СтруктураПараметров = ПолучитьДанныеРасшифровки(Элементы.Результат.ТекущаяОбласть.Расшифровка);
	Исключение
		ПоказатьПредупреждение(, "Выберите область номенклатуры");
		Возврат;
	КонецПопытки;
	
	Если Не (СтруктураПараметров.Свойство("Номенклатура") И СтруктураПараметров.Свойство("ВидЦен")) Тогда
		Возврат;     
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("Номенклатура, ВидЦен");
	ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтруктураПараметров);
	ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.ФормаСписка", Новый Структура("Отбор", СтруктураОтбора));
	
КонецПроцедуры

&НаКлиенте
// Процедура - команды Печать.
//
Процедура Печать(Команда)
	
	Если Результат = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Результат.КоличествоЭкземпляров = 1;
	
	Если НЕ Результат.АвтоМасштаб И НЕ ЗначениеЗаполнено(Результат.ИмяПринтера) Тогда
		Результат.АвтоМасштаб = Истина;
	КонецЕсли;
	
	Низ   = Результат.ФиксацияСверху;
	Если Элементы.ОтображатьЗаголовок.Пометка Тогда
		Результат.ПовторятьПриПечатиСтроки = Результат.Область(Низ-2,,Низ,);
	Иначе
		Результат.ПовторятьПриПечатиСтроки = Результат.Область(Низ-3,,Низ,);
	КонецЕсли;
	
	Результат.Напечатать(Ложь);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события команды "ОткрытьСписокВПродажеОтбор".
//
Процедура ОткрытьСписокВПродажеОтбор(Команда)
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("Все", "Все");
	СписокЗначений.Добавить("ВПродаже", "В продаже");
	СписокЗначений.Добавить("СнятСПродажи", "Снят с продажи");
	Оповещение = Новый ОписаниеОповещения("ОткрытьСписокВПродажеОтборЗавершение", ЭтотОбъект);
	ПоказатьВыборИзМеню(Оповещение, СписокЗначений, ЭтаФорма.Элементы.ОткрытьСписокВПродажеОтбор);

КонецПроцедуры

&НаКлиенте
// Процедура, асинхронный обработчик события команды "ОткрытьСписокВПродажеОтборЗавершение".
//
Процедура ОткрытьСписокВПродажеОтборЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВПродажеОтбор = Результат.Значение;	
	Элементы.ОткрытьСписокВПродажеОтбор.Заголовок = Результат.Представление;
	
	НастройкиШапкиПрайсаПриИзменении(); 
	
КонецПроцедуры 

&НаКлиенте 
// Процедура, Обработчик события "Скомпоновать".
//
Процедура Скомпоновать(Команда)
	
	ЭтаФорма.СкомпоноватьРезультат();
	ПроверкаФиксации();
	Элементы.ГруппаПанельРезультат.Доступность = Истина;
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция - Получить список салонов.
//
Функция ПолучитьСписокСалонов()
	
	ТаблицаСалонов	= ПолучитьТаблицуСалонов();
	СписокСалонов	= Новый СписокЗначений;
	
	СписокСалонов.Добавить(
	Справочники.СтруктурныеЕдиницы.ПустаяСсылка(),
	"Сетевая цена" , ,
	БиблиотекаКартинок.Реквизит);    
	
	Для Каждого СтрокаСалон Из ТаблицаСалонов Цикл
		Если ЗначениеЗаполнено(СтрокаСалон.Салон) Тогда    			
			СписокСалонов.Добавить(
			СтрокаСалон.Салон,
			Строка(СтрокаСалон.Салон) , ,
			БиблиотекаКартинок.Реквизит);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокСалонов;
	
КонецФункции

&НаСервере
// Функция - Получить таблицу салонов.
//
Функция ПолучитьТаблицуСалонов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Салон
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	|	И СтруктурныеЕдиницы.ЭтоГруппа = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СтруктурныеЕдиницы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктурныеЕдиницы.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
// Процедура - Сдвинуть область для заголовка
//   
Процедура СдвинутьОбластьДляЗаголовка()
	
	Если Результат.Область(1,1).Текст = "Иерархия" Тогда
		Результат.ВставитьОбласть(Результат.Область(1,1), Результат.Область(1,1), ТипСмещенияТабличногоДокумента.ПоВертикали);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода ПерезаполнитьЦены.
//
Процедура НастройкиШапкиПрайсаПриИзменении()
		
	УстановитьПараметрыКомпоновкиОтчета(); 
	ИзменитьРежимОтображенияРезультата();
	Элементы.ГруппаПанельРезультат.Доступность = Ложь; 
	
КонецПроцедуры

&НаКлиенте
// Обработчик события ОбработкаРасшифровки элемента Результат.
//
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если НЕ Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность Тогда
		
		СтруктураПараметров = ПолучитьДанныеРасшифровки(Расшифровка);
		
		Если СтруктураПараметров.Свойство("Номенклатура") И СтруктураПараметров.Свойство("ВидЦен") И СтруктураПараметров.Свойство("Упаковка") Тогда
			Изменить(Неопределено);
		ИначеЕсли СтруктураПараметров.Свойство("Основной") Тогда 
			
			Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Основной) Тогда
				СтандартнаяОбработка = Истина;
			Иначе
				ОткрытьФорму(ВернутьПолноеИмяФормы(СтруктураПараметров.Основной, ПроверкаИерархии(Расшифровка)), Новый Структура("Ключ", СтруктураПараметров.Основной));
			КонецЕсли;
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Функция возвращает данные расшифровки по расшифровке поля
//
// Параметры
//  <Расшифровка>  - ИндентификаторРасшифровки - Расшифровка ячейки
//
// Возвращаемое значение:
//   <Структура>   - Структура значений расшифровки
//
Функция ПолучитьДанныеРасшифровки(Расшифровка)
	
	СтруктураПараметров = Новый Структура("Период, СтруктурнаяЕдиница");
	
	СтруктураПараметров.Период = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Период").Значение;
	СтруктураПараметров.СтруктурнаяЕдиница = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СтруктурнаяЕдиница").Значение;
	
	Если ТипЗнч(Расшифровка) = Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
		
		ЭлементРасшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки).Элементы.Получить(Расшифровка);
		
		Для Каждого ЭлементПоля Из ЭлементРасшифровки.ПолучитьПоля() Цикл
			СтруктураПараметров.Вставить(ЭлементПоля.Поле, ЭлементПоля.Значение);
			Если СтруктураПараметров.Свойство("Основной") Тогда
				СтруктураПараметров.Основной = ЭлементПоля.Значение;
			Иначе
				СтруктураПараметров.Вставить("Основной", ЭлементПоля.Значение);
			КонецЕсли;
		КонецЦикла;	
		Для Каждого ЭлементРодителя Из ЭлементРасшифровки.ПолучитьРодителей() Цикл
			Для Каждого ЭлементРКД Из ЭлементРодителя.ПолучитьПоля() Цикл
				СтруктураПараметров.Вставить(ЭлементРКД.Поле, ЭлементРКД.Значение);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураПараметров;

КонецФункции // ОткрытьФормуЭлементаСправочника()

&НаСервере
// Функция возвращает ключ записи регистра.
//
Функция ПолучитьКлючЗаписи(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЦеныНоменклатурыСрезПоследних.Период,
	|	ЦеныНоменклатурыСрезПоследних.ДеньНедели,
	|	ЦеныНоменклатурыСрезПоследних.ВремяНачала,
	|	ЦеныНоменклатурыСрезПоследних.ВремяОкончания
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&НаДату,
	|			Актуальность = ИСТИНА
	|				И ВидЦен = &ВидЦен
	|				И Упаковка = &Упаковка
	|				И Номенклатура = &Номенклатура
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И ДеньНедели = 0
	|				И ВремяНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И ВремяОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("НаДату", 			СтруктураПараметров.Период);
	Запрос.УстановитьПараметр("Номенклатура", 		СтруктураПараметров.Номенклатура);
	Запрос.УстановитьПараметр("Упаковка", 			СтруктураПараметров.Упаковка);
	Запрос.УстановитьПараметр("ВидЦен", 			СтруктураПараметров.ВидЦен);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	СтруктураПараметров.СтруктурнаяЕдиница);
	
	СтруктураВозврата = Новый Структура("Период, ВидЦен, Номенклатура, Упаковка, СтруктурнаяЕдиница, ДеньНедели, ВремяНачала, ВремяОкончания");	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, СтруктураПараметров);
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Если ТаблицаРезультат.Количество() > 0 Тогда
		СтруктураВозврата.Период = ТаблицаРезультат[0].Период;
		Возврат СтруктураВозврата;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКлючЗаписи()

&НаСервере
// Процедура удаляет запись регистра.
//
Процедура УдалитьНаСервере(СтруктураПараметров)
	
	КлючЗаписи = ПолучитьКлючЗаписи(СтруктураПараметров);
	
	Если КлючЗаписи <> Неопределено Тогда
		
		НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
		Для каждого ЭлементСтруктуры Из КлючЗаписи Цикл
			НаборЗаписей.Отбор[ЭлементСтруктуры.Ключ].Установить(ЭлементСтруктуры.Значение);	
		КонецЦикла; 
		НаборЗаписей.Записать();
		
	КонецЕсли; 	
	
КонецПроцедуры // Удалить()

&НаСервере
// Процедура устанавливает значения параметра отчета из реквизитов.
//
Процедура УстановитьПараметрыКомпоновкиОтчета()
	
	//ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 
	//   ОтчетОбъект.СформироватьОтчет(Элементы.Результат, ДанныеРасшифровки);
	//МакетЗаголовокПодвал = Отчет.ПолучитьМакет("Заголовок");
	//Результат.Очистить(); 
	
	ЭлементыПараметраДанных = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	ЭлементыПараметраВывода = Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы;
	
	ЭлементыПараметраДанных.Найти("Период").Значение 		          = НачалоДня(СрезПрайса);
	ЭлементыПараметраДанных.Найти("Период").Использование 	          = Истина;
	ЭлементыПараметраДанных.Найти("СтруктурнаяЕдиница").Значение 	  = СтруктурнаяЕдиница;
	ЭлементыПараметраДанных.Найти("СтруктурнаяЕдиница").Использование = Истина;
	ЭлементыПараметраДанных.Найти("ВПродаже").Значение 		          = ?(ВПродажеОтбор = "Все", Неопределено, ?(ВПродажеОтбор = "ВПродаже", Истина, Ложь));
	ЭлементыПараметраДанных.Найти("ВПродаже").Использование           = Истина;    	
	
	ЭлементыПараметраДанных.Найти("ВыводитьЗаголовок").Значение		  = ОтображатьЗаголовок;
	ЭлементыПараметраДанных.Найти("ВыводитьЗаголовок").Использование  = ОтображатьЗаголовок;
	ЭлементыПараметраДанных.Найти("Организация").Значение 			  = Организация;
	ЭлементыПараметраДанных.Найти("Организация").Использование 	      = Истина;
	ЭлементыПараметраДанных.Найти("Сотрудник").Значение				  = ФИОГенДиректора;
	ЭлементыПараметраДанных.Найти("Сотрудник").Использование 		  = Истина;
 
	//ЭлементыПараметраВывода.Найти("Заголовок").Значение = ""+Элементы.ОткрытьСписокСалоны.Заголовок+ Символы.Таб + " УТВЕРЖДАЮ Генеральный директор" +Символы.ПС +"прайс-лист от " + Формат(СрезПрайса, "ДФ=dd.MM.yyyy") + Символы.Таб  + ФИОГенДиректора;  
	//ЭлементыПараметраВывода.Найти("Заголовок").Использование = Элементы.ОтображатьЗаголовок.Пометка; 
	
КонецПроцедуры

&НаСервере
// Функция возвращает полный путь к форме объекта справочника
//
Функция ВернутьПолноеИмяФормы(Ссылка, Группа)
	
	Если Группа Тогда
		ПолноеИмяФормыСсылки = "Справочник." + Ссылка.Метаданные().Имя + ".ФормаГруппы";
	Иначе
		ПолноеИмяФормыСсылки = "Справочник." + Ссылка.Метаданные().Имя + ".Форма.ФормаЭлемента";
	КонецЕсли;
	Возврат ПолноеИмяФормыСсылки;
	
КонецФункции

&НаКлиенте
// Функция  проверки фиксации
// 
Процедура ПроверкаФиксации()
	
	Если Элементы.ОтображатьЗаголовок.Пометка Тогда
		Результат.ФиксацияСверху	= 6;
		Результат.ФиксацияСлева		= 0;
	Иначе
		Результат.ФиксацияСверху	= 2;
		Результат.ФиксацияСлева		= 0;
	КонецЕсли;
	
	Результат.Автомасштаб = Истина;
	Результат.ОтображатьСетку = Ложь;
	
КонецПроцедуры

&НаСервере  
// Функция  проверки иерархии
// 
Функция ПроверкаИерархии(Расшифровка)
	
	Возврат ПолучитьИзВременногоХранилища(ДанныеРасшифровки).Элементы.Получить(Расшифровка).ПолучитьПоля()[0].Иерархия;
	
КонецФункции

&НаКлиенте     
// Процедура - Выбор среза прайса
//
Процедура ВыбратьСрезПрайса(Команда)
	
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода", ТекущаяДата(), ТекущаяДата());
	ОписаниеОповещения = Новый ОписаниеОповещения("ПредставлениеДатыНажатиеЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериодаДень", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Представление даты нажатие завершение.
//
// Параметры:
//  Результат	 - 	 -
//  Параметры	 - 	 -
//
Процедура ПредставлениеДатыНажатиеЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СрезПрайса = Результат.НачалоПериода;  
	Элементы.ВыбратьПериодПланирования.Заголовок = Формат(СрезПрайса, "ДЛФ=ДД.ММ.ГГГГ");
	НастройкиШапкиПрайсаПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ИмяФайла = "ПрайсЛист.xls";
	ДиалогОткрытияФайла                    = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогОткрытияФайла.ПолноеИмяФайла     = ИмяФайла;
	ДиалогОткрытияФайла.Каталог		       = КаталогВременныхФайлов();
	ДиалогОткрытияФайла.Фильтр		       = "Файлы Microsoft Excel (*.xls)|*.xls|Все файлы (*.*)|*.*";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	
	ДиалогОткрытияФайла.Показать(Новый ОписаниеОповещения("СохранитьЗавершение", ЭтотОбъект, Новый Структура("ДиалогОткрытияФайла", ДиалогОткрытияФайла))); 
	 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогОткрытияФайла = ДополнительныеПараметры.ДиалогОткрытияФайла;
	Если (ВыбранныеФайлы <> Неопределено) тогда
		Результат.НачатьЗапись(, ДиалогОткрытияФайла.ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS);
	КонецЕсли;

КонецПроцедуры  

&НаКлиенте 
// Процедура, меняет режим отображения отчета.
//
Процедура ИзменитьРежимОтображенияРезультата()
	
	// Сделано для того чтоб при изменении фильтров состояние отчета менялось, так же для того что бы заменить стандартный
	// Текст неактуального отчета.
	Элементы.Результат.ОтображениеСостояния.Видимость = Истина;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.Результат.ОтображениеСостояния.Текст = "Прайс-лист не сформирован. Нажмите ""Сформировать"" для получения прайс-листа.";
	
КонецПроцедуры	

#КонецОбласти
